app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"
---
	def show
		@post = Post.find(params[:id])
		@posts = Post.all